[{"role":"CUSTOMER","content":"OK."},{"role":"CUSTOMER","content":"Hello."},{"role":"AGENT","content":"Hi Praveen."},{"role":"AGENT","content":"Hey, how are you?"},{"role":"CUSTOMER","content":"Uh, once again."},{"role":"AGENT","content":"Sure, sure, sure."},{"role":"AGENT","content":"I hear other noises in the background, so."},{"role":"CUSTOMER","content":"OK, you can you still hear me?"},{"role":"AGENT","content":"I can still hear you, yeah."},{"role":"CUSTOMER","content":"Yeah."},{"role":"AGENT","content":"You must be in the office."},{"role":"CUSTOMER","content":"OK, super."},{"role":"CUSTOMER","content":"Yes, yes, I, yeah."},{"role":"AGENT","content":"Oh, perfect, perfect. Yeah, so I thought I would just do a, uh, a real-time transcription. So really what that really means is, um, while we're talking here, I thought, let's take a look and see how quick the transcription comes and how accurate the summary is."},{"role":"CUSTOMER","content":"It"},{"role":"CUSTOMER","content":"Mm"},{"role":"CUSTOMER","content":"And."},{"role":"CUSTOMER","content":"so it's kind of like OK."},{"role":"AGENT","content":"OK."},{"role":"CUSTOMER","content":"So, my question, right, um, OK. When we want to do this, so have they already started on it or they haven't."},{"role":"CUSTOMER","content":"Do the summarization uh using Geni."},{"role":"AGENT","content":"So"},{"role":"AGENT","content":"No, no, summarization is summarization is not really part of of the SOW."},{"role":"CUSTOMER","content":"Oh"},{"role":"CUSTOMER","content":"I"},{"role":"CUSTOMER","content":"Right."},{"role":"AGENT","content":"Um"},{"role":"AGENT","content":"But they do already have contact lens enabled."},{"role":"CUSTOMER","content":"So it doesn't."},{"role":"AGENT","content":"So, if we wanted to enable summarization for contact lens. It really is like a 3-second job. It, it is, uh, the screenshot that I sent you."},{"role":"CUSTOMER","content":"It's like hm."},{"role":"AGENT","content":"Um, they really just have to adjust it to include the call summarization and then they, they'll have two choices, whether it's um, you know, real time or, or, or um just post analytics."},{"role":"CUSTOMER","content":"Oh."},{"role":"CUSTOMER","content":"I guess."},{"role":"AGENT","content":"I think for the use case to make any sense."},{"role":"CUSTOMER","content":"That's."},{"role":"AGENT","content":"You really want a real time."},{"role":"CUSTOMER","content":"not"},{"role":"AGENT","content":"Because you want that summary to be very quick when the call finishes."},{"role":"CUSTOMER","content":"You can."},{"role":"CUSTOMER","content":"OK. I don't know. So I think we need to understand a little bit, so currently, how are they doing the summarization? Is there a need for summarization?"},{"role":"AGENT","content":"So, at the moment,"},{"role":"CUSTOMER","content":"And then how are they doing it and what time, how much time it takes."},{"role":"AGENT","content":"Yes, at the moment, I don't believe they are doing it. So I know they're not doing it for the POC and it's not something they asked for in the POC."},{"role":"CUSTOMER","content":"Uh"},{"role":"CUSTOMER","content":"It"},{"role":"CUSTOMER","content":"for that."},{"role":"CUSTOMER","content":"No, no, Robert, forget about BOC. I'm saying as a process, are they doing the summarization."},{"role":"AGENT","content":"Oh, OK, I, that I don't know. I'll have to speak to Chris to find out."},{"role":"CUSTOMER","content":"Mhm"},{"role":"CUSTOMER","content":"Really"},{"role":"AGENT","content":"So I don't know if they're doing that."},{"role":"CUSTOMER","content":"I mean, without giving what we want to do as a background, is there a possibility to understand?"},{"role":"CUSTOMER","content":"You know what they're doing."},{"role":"CUSTOMER","content":"Today. But"},{"role":"AGENT","content":"I think there is. I wasn't involved in the the initial discussions with them. So really all my discussions now are all around the POC so there's nothing to stop me from reaching out to Chris, um, from DHL to find out how we can, you know, include some of this stuff in, and potentially show them."},{"role":"CUSTOMER","content":"Yeah, but we look at this."},{"role":"CUSTOMER","content":"Mhm."},{"role":"CUSTOMER","content":"No, no, no, no, no, no, no, no."},{"role":"CUSTOMER","content":"No, no, so I think we need to approach in a different way so I think we need to work smartly understand."},{"role":"AGENT","content":"OK."},{"role":"CUSTOMER","content":"Are they doing it today, uh, and what is their average time spent on summarization."},{"role":"AGENT","content":"Yes, yes, yes. That would make sense."},{"role":"CUSTOMER","content":"Without proposing we want to do this, uh, you know, uh, you know."},{"role":"CUSTOMER","content":"Or we would like to explore this or nothing of that sort. So but I just want to understand it."},{"role":"AGENT","content":"OK, and unfortunately, because I didn't know the customer before the POC started, all my interactions with them have been around the PFC."},{"role":"CUSTOMER","content":"Mm"},{"role":"CUSTOMER","content":"Yeah."},{"role":"CUSTOMER","content":"Understand. Um, OK, so maybe I think it, this is something Praveer said he will check, right?"},{"role":"AGENT","content":"Yes, I think so, yeah."},{"role":"CUSTOMER","content":"Uh, so let him come back. OK."},{"role":"AGENT","content":"Yeah."},{"role":"CUSTOMER","content":"So when you say the they already have a contact lens, um, this is the technology that we wanna use for summarization, is that correct?"},{"role":"AGENT","content":"And that"},{"role":"AGENT","content":"Yes."},{"role":"AGENT","content":"Well, this is one of the potential summarizations, um, technologies that we've got there. So what does that really mean for us? Um, so if we're using the Amazon Connect out of the box summarization, the only value that we're adding is gonna be that CRM integration."},{"role":"CUSTOMER","content":"Mm"},{"role":"CUSTOMER","content":"your new mm."},{"role":"CUSTOMER","content":"Yeah, you need a dynamic."},{"role":"AGENT","content":"Now, if they find that the um the summarization isn't as accurate as they would like, then we would look to use like a hugging face, um."},{"role":"CUSTOMER","content":"OK. The day from your from from so."},{"role":"AGENT","content":"Model in bedrock or something and then generate that using, using the AWS services."},{"role":"CUSTOMER","content":"OK but if they already have a contact lens, uh, and then it can do the summarization."},{"role":"AGENT","content":"But"},{"role":"AGENT","content":"The first we did the first call that I sent to you."},{"role":"CUSTOMER","content":"You can see a good uh so."},{"role":"AGENT","content":"So the first"},{"role":"CUSTOMER","content":"Go ahead first."},{"role":"AGENT","content":"I, I was gonna say that the, the summarization I sent to you in the call in the in the screenshot, um, I basically called my broker, um, in the the US to find out about the tax. And the summarization was pretty accurate."},{"role":"CUSTOMER","content":"Mm"},{"role":"CUSTOMER","content":"Mm"},{"role":"CUSTOMER","content":"Mm"},{"role":"CUSTOMER","content":"Yeah."},{"role":"CUSTOMER","content":"I understand it."},{"role":"AGENT","content":"Yeah, so it'll be interesting to see this is a much longer call, so it'd be interesting to see what this."},{"role":"CUSTOMER","content":"Um."},{"role":"CUSTOMER","content":"7 what what about uh Amazon."},{"role":"CUSTOMER","content":"You right? so because one is contact lens and the second one is the queue."},{"role":"AGENT","content":"So"},{"role":"CUSTOMER","content":"How is the queue."},{"role":"AGENT","content":"So Q is more of like a knowledge search itself. So if you think about um what I might do is I might throw a whole bunch of uh FAQs and things like that into uh S3 bucket and then index them into, into, you know, a bedrock model."},{"role":"CUSTOMER","content":"Mm"},{"role":"CUSTOMER","content":"I, OK, that's good."},{"role":"CUSTOMER","content":"Mm"},{"role":"CUSTOMER","content":"Uh, then you"},{"role":"AGENT","content":"And use Amazon Q to be able to augment it. So think of it like a chat GPT where they where the um cus where the agent could easily ask questions. In fact, they could even just as the person's talking, start spreading up links and, and, and, and get content for that."},{"role":"CUSTOMER","content":"Mm, OK."},{"role":"CUSTOMER","content":"OK, great. Uh anything else we need to cover?"},{"role":"CUSTOMER","content":"Oh."},{"role":"CUSTOMER","content":"Thank you so much."},{"role":"CUSTOMER","content":"So, uh, the queue will not help on the summarization, you will not help on the summarization."},{"role":"AGENT","content":"Which is very similar to an agent."},{"role":"AGENT","content":"2 is not really a summarization thing so I would use, I would probably use, um, bedrock for that."},{"role":"CUSTOMER","content":"Well"},{"role":"AGENT","content":"And it's just an API call, so I've done some tests with that, and it really is. I, I'll send a transcript."},{"role":"CUSTOMER","content":"I see, I see."},{"role":"AGENT","content":"To, to the, to the, to the, to the engine and I could load different different speech recognition, uh, LLMs, so I could use a hugging face multi multi-language one. I could use a single language one. there's that sea lion which is all the South um Southeast Asia languages, so it has Thai and has"},{"role":"CUSTOMER","content":"Mm."},{"role":"CUSTOMER","content":"So because we had."},{"role":"CUSTOMER","content":"I"},{"role":"CUSTOMER","content":"So I say to you."},{"role":"AGENT","content":"Um, Bahasa and has, you know, Filipino, um."},{"role":"CUSTOMER","content":"I, I you."},{"role":"AGENT","content":"In it and, and it also includes Singlish. Now that's great."},{"role":"CUSTOMER","content":"I thought it may I just very busy, uh."},{"role":"AGENT","content":"But that also requires that the transcript is going to be accurate."},{"role":"AGENT","content":"So that's, that's where I think."},{"role":"AGENT","content":"You know, you might find some things will fall down a bit."},{"role":"CUSTOMER","content":"Which one's transcript is uh not accurate?"},{"role":"AGENT","content":"So"},{"role":"AGENT","content":"So if the transcript is not accurate, so for instance, right now, uh, if we take a look at uh out of the box, tie the tha tan transcript wouldn't be sort of supported, so we'd have to go to another model to get that transcript. So we grabbed that recording and then do the transcript of that, and that would require us creating a time model. If Tai was, you know, if we're looking at."},{"role":"CUSTOMER","content":"Mm."},{"role":"CUSTOMER","content":"So that is for what summarization sorry that is for summarization or for the agent assist."},{"role":"AGENT","content":"For the, that's for the transcript."},{"role":"CUSTOMER","content":"It"},{"role":"AGENT","content":"So that would be for summarization. so transcribe it first, then let's get a summarization of that transcription."},{"role":"CUSTOMER","content":"Mm, yeah, yeah, OK."},{"role":"AGENT","content":"Yeah, yeah, yeah. So really, if you think about it."},{"role":"CUSTOMER","content":"So what you're saying then is, you know, if this contact lenses accurate enough, then we can just"},{"role":"CUSTOMER","content":"Use the contact lens, but if, if this is not accurate, then probably we need to use some sort of a bedrock and custom model."},{"role":"AGENT","content":"That's exactly correct."},{"role":"AGENT","content":"And the summarization is going to come out of whatever they transcript looks like. So we would need an accurate transcript to get an accurate summary."},{"role":"CUSTOMER","content":"First of all, I think we need any and I think we can we can from from my end."},{"role":"CUSTOMER","content":"And so, uh, the transcription, um,"},{"role":"CUSTOMER","content":"Is it already done in Amazon connect or uh or you need to wait uh see if it is accurate enough so."},{"role":"AGENT","content":"So it"},{"role":"AGENT","content":"If, if, so"},{"role":"AGENT","content":"So yeah, you, you, um, we need to take a look and vet that it's accurate enough."},{"role":"AGENT","content":"Um, it, it'll be very accurate for my voice, for instance, because it's trained on American style voices. So it really comes down to the Singlish and then comes down to the Mandarin, um, and other languages that they'll be speaking."},{"role":"AGENT","content":"So I'd be very confident on the, on the US style of English, and you've got multiple languages that you can select, but yeah, we would have to do some sample testing."},{"role":"CUSTOMER","content":"Not for you."},{"role":"CUSTOMER","content":"I don't, it hasn't really only be paying for."},{"role":"AGENT","content":"And that should be easy enough for us to make some sample calls even in this instance."},{"role":"CUSTOMER","content":"Some, you know. Yeah. So, I don't we, we do have some."},{"role":"AGENT","content":"Where, uh, I'm talking to somebody who's Singlish or whatever."},{"role":"CUSTOMER","content":"I'm DS. OK, OK, so I think we need to create a C, you know, create an approach if, uh, you know, this English is gonna work out. What is the accuracy? If not, then how do we do it? So I think we need to have that kind of an up approach to make it uh robust enough to put it in a production environment, but how do we integrate?"},{"role":"AGENT","content":"Sure, yeah."},{"role":"CUSTOMER","content":"I think uh that's the question that you have, but I think we need to work out that later, but I think first and foremost I think is to get to the approach, uh, you know, what are the couple of approaches that we wanna take, uh, to enhance the accuracy and make it production that is from a summarization and same goes for uh assist as well. You know, let's say for example, I don't know NCS, uh, what do they do, uh, you know, if they have a website, for example, right? Um, you know."},{"role":"AGENT","content":"Yeah."},{"role":"CUSTOMER","content":"Can I bring all that knowledge inside that and, you know, create all the FAQs in a lot more empathetic and intelligent way, right?"},{"role":"AGENT","content":"Yes, and that's exactly the agent."},{"role":"CUSTOMER","content":"So this is, uh, you know, cancer, cancer center, so that means it's a lot of innovation, a lot of education training, a lot of videos, many, many things will be there, right? So how do we, uh, um."},{"role":"AGENT","content":"Exactly."},{"role":"CUSTOMER","content":"Uh, probably there will be, uh, discussion on appointment and things like that or you know doctor like, uh, you know, uh maybe some details about education, some detail about knowledge of separate cancers and a few other things will be there, right? So how do we bring all that information together."},{"role":"CUSTOMER","content":"Uh, you know, help agent to, you know, answer in a better way, right?"},{"role":"CUSTOMER","content":"Yeah."},{"role":"AGENT","content":"Correct, yeah."},{"role":"AGENT","content":"And I would see part of that is going to be using the Amazon Que with the knowledge base."},{"role":"AGENT","content":"And the knowledge base is really easy to keep up to date because you just throw your documents into an S3 bucket."},{"role":"AGENT","content":"Um, we did, we did a small demo, um, while we're looking at SSG. So I did a small demo in one of the accounts here and threw in a bunch of security type questions."},{"role":"CUSTOMER","content":"Mm, mm."},{"role":"AGENT","content":"Into it and I asked questions that were very specific around those documents."},{"role":"AGENT","content":"And that did work well."},{"role":"CUSTOMER","content":"Mm."},{"role":"AGENT","content":"Now I have another meeting now at 1:30 or 2:30."},{"role":"CUSTOMER","content":"Yeah"},{"role":"CUSTOMER","content":"Yeah, same here. So, OK."},{"role":"AGENT","content":"So, I'll have to let you go."},{"role":"CUSTOMER","content":"Uh, so I think I need a couple of slide on uh how, how, you know, what is the approach."},{"role":"CUSTOMER","content":"For a better accuracy, uh, on, on both of these use case and then and also some sort of uh effort required to do this and then uh we can take it, yeah? All right. Thank you."},{"role":"AGENT","content":"Perfect, right? Sounds good. I'll send you the summary as soon as it comes through."},{"role":"CUSTOMER","content":"Yeah, yeah, yeah."},{"role":"AGENT","content":"Cool. All right, thank you. Take care. Bye-bye."},{"role":"CUSTOMER","content":"Just"}]